; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(arm-empty)
(on b1 b10)
(on b2 b6)
(on b3 b5)
(on b4 b7)
(on b5 b2)
(on b6 b12)
(on b7 b3)
(on b8 b1)
(on b9 b4)
(on b10 b9)
(on-table b11)
(on-table b12)
(clear b8)
(clear b11)
)
(:goal
(and
(on b1 b2)
(on b2 b11)
(on b3 b7)
(on b5 b4)
(on b6 b12)
(on b8 b3)
(on b9 b5)
(on b10 b8)
(on b11 b9)
(on b12 b10))
)
)

; plan
1. (unstack b8 b1)
   deleted: (on b8 b1) (clear b8) (arm-empty)
   added: (holding b8) (clear b1)
   goals met: 1 of 10
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 10
3. (unstack b1 b10)
   deleted: (on b1 b10) (clear b1) (arm-empty)
   added: (holding b1) (clear b10)
   goals met: 1 of 10
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 10
5. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 1 of 10
6. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 10
7. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 1 of 10
8. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 10
9. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 1 of 10
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 10
11. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 1 of 10
12. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 10
13. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 1 of 10
14. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 2 of 10
15. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 2 of 10
16. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 3 of 10
17. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 3 of 10
18. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 4 of 10
19. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 4 of 10
20. (stack b10 b8)
   deleted: (clear b8) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b8)
   goals met: 5 of 10
21. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 5 of 10
22. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 6 of 10
23. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 6 of 10
24. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 7 of 10
25. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 7 of 10
26. (stack b2 b11)
   deleted: (clear b11) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b11)
   goals met: 8 of 10
27. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 10
28. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 9 of 10
29. (unstack b6 b12)
   deleted: (on b6 b12) (clear b6) (arm-empty)
   added: (holding b6) (clear b12)
   goals met: 8 of 10
30. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 8 of 10
31. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 8 of 10
32. (stack b12 b10)
   deleted: (clear b10) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b10)
   goals met: 9 of 10
33. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 10
34. (stack b6 b12)
   deleted: (clear b12) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b12)
   goals met: 10 of 10
